'''
запросить цену закупки телефона и выдать следующую информацию.
	- цена продажи (+30% к цене закупке)
	- цена продажи со скидкой 5%
	- цена продажи со скидкой 10%
	- цена продажи со скидкой 15%
'''

pr_p = int (input ("цена закупки телефона = "))
pr_s = pr_p + (pr_p*30/100)

print ('- цена продажи (+30% к цене закупке) = ', pr_s)
print ('- цена продажи со скидкой 5% = ', round(pr_s - (pr_s*5/100), 2))
print ('- цена продажи со скидкой 10% = ', round(pr_s - (pr_s*10/100),2))
print ('- цена продажи со скидкой 15% = ', round(pr_s - (pr_s*15/100),2))
