'''
Даны данные пользователя в строке:
    s = "имя: Дмитрий, фамилия: Иванов, возраст: 18"
    Программа должна достать из этой строки, имя, фамилию и возраст пользователя 
    присвоить их отдельным переменным и вывести на экран  через один print(), 
    но каждый элемент должен быть выведен в новой строке. 
    Программа должна работать с любой аналогичной строкой с данными др. человека.
        пример вывода:        
            - Дмитрий
            - Иванов
            - 18

'''

s = "имя: Дмитрий, фамилия: Иванов, возраст: 18"
spis = s.split(": ")
name_cher = spis[1].split(',')
name = name_cher[0]
surname_cher = spis[2].split(',')
surname = surname_cher[0]
age = spis[3]
print ('- ' + name, '- ' + surname,'- ' + age, sep="\n")